---
kind: method
id: M:Autodesk.Revit.DB.Analysis.MEPNetworkSegmentData.#ctor(Autodesk.Revit.DB.Analysis.MEPNetworkSegmentData)
source: html/825a23f1-0857-5bad-45f8-554074fd9468.htm
---
# Autodesk.Revit.DB.Analysis.MEPNetworkSegmentData.#ctor Method

Creates a new segment data object based on another object.

## Syntax (C#)
```csharp
public MEPNetworkSegmentData(
	MEPNetworkSegmentData other
)
```

## Parameters
- **other** (`Autodesk.Revit.DB.Analysis.MEPNetworkSegmentData`) - The other segment data that the new object is based on.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null